/******************************************************************************

                  版权所有 (C), 2013-2023, 深圳博思高科技有限公司

 ******************************************************************************
  文 件 名   : msg.h
  版 本 号   : 初稿
  作    者   : 张舵
  生成日期   : 2020年1月8日
  最近修改   :
  功能描述   : 操作系统中用于任务间通讯的定义
  函数列表   :
  修改历史   :
  1.日    期   : 2020年1月8日
    作    者   : 张舵
    修改内容   : 创建文件

******************************************************************************/
#ifndef __MSG__H
#define __MSG__H

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "event_groups.h"

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define  QUEUE_LEN    20     /* 队列的长度，最大可包含多少个消息 */


//事件标志
#define TASK_BIT_0	 (1 << 0)
#define TASK_BIT_1	 (1 << 1)
#define TASK_BIT_2	 (1 << 2)
#define TASK_BIT_3	 (1 << 3)
#define TASK_BIT_4	 (1 << 4)
#define TASK_BIT_5	 (1 << 5)
#define TASK_BIT_6	 (1 << 6)
#define TASK_BIT_7	 (1 << 7)
#define TASK_BIT_8	 (1 << 8)


#define TASK_BIT_ALL ( TASK_BIT_0 | TASK_BIT_1 | TASK_BIT_2 |TASK_BIT_3|TASK_BIT_4|TASK_BIT_5|TASK_BIT_6)


/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/
extern EventGroupHandle_t xCreatedEventGroup;

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/





#endif


