/******************************************************************************

                  版权所有 (C), 2013-2023, 深圳博思高科技有限公司

 ******************************************************************************
  文 件 名   : templateprocess.h
  版 本 号   : 初稿
  作    者   : 张舵
  生成日期   : 2020年1月10日
  最近修改   :
  功能描述   : 模版参数处理头文件件
  函数列表   :
  修改历史   :
  1.日    期   : 2020年1月10日
    作    者   : 张舵
    修改内容   : 创建文件

******************************************************************************/
#ifndef __TEMPLATEPROCESS_H_
#define __TEMPLATEPROCESS_H_

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

//创建人信息
typedef struct
{
    uint8_t createorID[12];
    uint8_t createTime[20];
    uint8_t createCompanyId[12];
    uint8_t updateUserId[12];
    uint8_t updateUserName[20];
    uint8_t createTime[20];
}CREATOR_INFO_T;

//呼梯方式
typedef enum {
    FACE,
    QR_CODE,
    IC_CARD,
    APPOINTMENT,
    REMOTE
} CALL_MODE;

//工作模式 一般/高峰/节假日
typedef enum {
    PEAKMODE,
    HELIDAYMODE    
} WORK_TYPE;

typedef struct
{
    WORK_TYPE wMode;
    uint8_t beginTimep[20];
    uint8_t endTime[20];
    uint8_t outsideTime[20];
}WORK_MODE_T;


typedef struct
{
    WORK_MODE_T workMode;
    CREATOR_INFO_T creatorInfo;
    CALL_MODE callMode;
}TMEPLATE_T;
    

//

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/




#endif

